:PROPERTIES:
:ID:       5C3C29D0-540F-4F03-88CF-DE7E2C1CC028
:header-args: :results output :session hf :async yes
:END:
#+title: hugging-face
* Command Line
** Installation

#+begin_src shell :session hf :async yes :results output
  curl -LsSf https://hf.co/cli/install.sh | bash
#+end_src

#+RESULTS:
#+begin_example
curl -LsSf https://hf.co/cli/install.sh | bash
[INFO] Installing Hugging Face CLI...
[INFO] OS: macos
[INFO] Force reinstall: false
[INFO] Install dir: /Users/mwhipple/.hf-cli
[INFO] Bin dir: /Users/mwhipple/.local/bin
[INFO] Skip PATH update: false
[WARNING] python3 detected (Python 3.9.6) but Python 3.10+ is required.
[INFO] Using Python: Python 3.14.6
[INFO] Creating directories...
[INFO] Creating virtual environment...
[INFO] Virtual environment already exists; reusing (pass --force to recreate)
[INFO] Installing/upgrading Hugging Face CLI (latest)...
[INFO] Installation output suppressed; set CLI_VERBOSE_PIP=1 for full logs
[INFO] Linking hf CLI into /Users/mwhipple/.local/bin...
[INFO] hf available at /Users/mwhipple/.local/bin/hf (symlink to venv)
[INFO] Run without touching PATH: env PATH="/Users/mwhipple/.local/bin:$PATH" hf --help
[INFO] /Users/mwhipple/.local/bin is not in your PATH
[INFO] Verifying installation...
[SUCCESS] Hugging Face CLI installed successfully!
[INFO] CLI location: /Users/mwhipple/.local/bin/hf
[INFO] Installation directory: /Users/mwhipple/.hf-cli
[INFO] Current version: ✓ hf version
  version: 1.21.0
[INFO] 
[INFO] To uninstall the Hugging Face CLI, run:
[INFO]   rm -rf /Users/mwhipple/.hf-cli
[INFO]   rm -f /Users/mwhipple/.local/bin/hf
[INFO] 
[INFO]   Remove any PATH edits you made manually.
[SUCCESS] hf CLI ready!
[INFO] Binary: /Users/mwhipple/.local/bin/hf
[INFO] Virtualenv: /Users/mwhipple/.hf-cli
[INFO] Try it now: env PATH="/Users/mwhipple/.local/bin:$PATH" hf --help
[INFO] Examples:
[INFO]   hf auth login
[INFO]   hf download deepseek-ai/DeepSeek-R1
[INFO]   hf jobs run python:3.12 python -c 'print("Hello from HF CLI!")'
[INFO]
[?2004hecho 'ob_comint_async_shell_end_7ab3044d-bd8c-4ad9-a25c-a8f6696d06bb'[?2004l
#+end_example
** Verification

#+begin_src emacs-lisp
  (let ((path "/Users/mwhipple/.local/bin"))
    (unless (mw/path/member path)
      (mw/path/cons path)))
#+end_src

#+RESULTS:
: /Users/mwhipple/.local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/homebrew/bin/

#+begin_src bash :results output
  hf --version
#+end_src

#+RESULTS:
: 1.21.0

** Help

#+begin_src shell
  hf --help
#+end_src

#+RESULTS:
#+begin_example
Usage: hf [OPTIONS] [COMMAND] [ARGS]...

  Hugging Face Hub CLI

Options:
  --install-completion  Install completion for the current shell.
  --show-completion     Show completion for the current shell, to copy it or
                        customize the installation.
  -h, --help            Show this message and exit.

Main commands:
  auth                 Manage authentication (login, logout, etc.).
  buckets              Commands to interact with buckets.
  cache                Manage local cache directory.
  collections          Interact with collections on the Hub.
  cp                   Copy files between local paths, repositories, and
                       buckets.
  datasets             Interact with datasets on the Hub.
  discussions          Manage discussions and pull requests on the Hub.
  download             Download files from the Hub.
  endpoints            Manage Hugging Face Inference Endpoints.
  extensions           Manage hf CLI extensions. [alias: ext]
  jobs                 Run and manage Jobs on the Hub.
  models               Interact with models on the Hub.
  papers               Interact with papers on the Hub.
  repos                Manage repos on the Hub. [alias: repo]
  skills               Manage skills for AI assistants.
  spaces               Interact with spaces on the Hub.
  sync                 Sync files between local directory and a bucket.
  upload               Upload a file or a folder to the Hub.
  upload-large-folder  Upload a large folder to the Hub.
  webhooks             Manage webhooks on the Hub.

Help commands:
  env      Print information about the environment.
  update   Update the `hf` CLI to the latest version.
  version  Print information about the hf version.

Examples
  $ hf cp hf://username/my-model/config.json
  $ hf download meta-llama/Llama-3.2-1B-Instruct
  $ hf upload my-cool-model . .
  $ hf upload-large-folder Wauplin/my-cool-model ./large_model_dir

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
#+end_example

** cache

*** Help

#+begin_src shell :session none :async no
  hf cache --help
#+end_src

#+RESULTS:
#+begin_example
Usage: hf cache [OPTIONS] COMMAND [ARGS]...

  Manage local cache directory.

Options:
  -h, --help  Show this message and exit.

Main commands:
  list    List cached repositories or revisions. [alias: ls]
  prune   Remove detached revisions and incomplete downloads from the cache.
  rm      Remove cached repositories or revisions.
  verify  Verify checksums for a single repo revision from cache or a local
          directory.

Examples
  $ hf cache ls
  $ hf cache prune
  $ hf cache rm model/gpt2
  $ hf cache verify gpt2

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
#+end_example

*** list

**** Help

#+begin_src shell :session none :async no
  hf cache list --help
#+end_src

#+RESULTS:
#+begin_example
Usage: hf cache list [OPTIONS]

  List cached repositories or revisions.

Options:
  --cache-dir TEXT                Cache directory to scan (defaults to Hugging
                                  Face cache).
  --revisions / --no-revisions    Include revisions in the output instead of
                                  aggregated repositories.  [default: no-
                                  revisions]
  -f, --filter TEXT               Filter entries (e.g. 'size>1GB',
                                  'type=model', 'accessed>7d'). Can be used
                                  multiple times.
  --sort [accessed|accessed:asc|accessed:desc|modified|modified:asc|modified:desc|name|name:asc|name:desc|size|size:asc|size:desc]
                                  Sort entries by key. Supported keys:
                                  'accessed', 'modified', 'name', 'size'.
                                  Append ':asc' or ':desc' to explicitly set
                                  the order (e.g., 'modified:asc'). Defaults:
                                  'accessed', 'modified', 'size' default to
                                  'desc' (newest/biggest first); 'name'
                                  defaults to 'asc' (alphabetical).
  --limit INTEGER                 Limit the number of results returned.
                                  Returns only the top N entries after
                                  sorting.
  -h, --help                      Show this message and exit.

Formatting options:
  --format [auto|human|agent|json|quiet]
                                  Output format. Defaults to 'auto' which
                                  picks 'agent' or 'human' based on the
                                  terminal.
  --json                          JSON output. Equivalent to '--format json'.
  -q, --quiet                     Quiet output (one ID per line). Equivalent
                                  to '--format quiet'.
  --no-truncate                   Do not truncate scalar values in human
                                  tables (list/dict columns stay shortened).

Examples
  $ hf cache ls
  $ hf cache ls --revisions
  $ hf cache ls --filter "size>1GB" --limit 20
  $ hf cache ls --format json

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
#+end_example

**** Usage

#+begin_src shell :session none :async no
  hf cache list
#+end_src

#+RESULTS:
: ID                                                  SIZE LAST_ACCESSED LAST_MODIFIED REFS
: -------------------------------------------------- ----- ------------- ------------- ----
: model/empero-ai/Qwythos-9B-Claude-Mythos-5-1M-GGUF 96.2G 1 day ago     22 hours ago  main
: [1m
: Found 1 repo(s) for a total of 1 revision(s) and 96.2G on disk.[0m


#+begin_src shell
  hf update --help
#+end_src

#+RESULTS:
#+begin_example
hf update --help
Usage: hf update [OPTIONS]

  Update the `hf` CLI to the latest version.

Options:
  -h, --help  Show this message and exit.

Formatting options:
  --format [auto|human|agent|json|quiet]
                                  Output format. Defaults to 'auto' which picks
                                  'agent' or 'human' based on the terminal.
  --json                          JSON output. Equivalent to '--format json'.
  -q, --quiet                     Quiet output (one ID per line). Equivalent to '--
                                  format quiet'.
  --no-truncate                   Do not truncate scalar values in human tables
                                  (list/dict columns stay shortened).
<hell_end_5d0aace3-790d-4965-8308-560a51ad17eb'[?2004l
#+end_example

* auth

#+begin_src shell
  hf auth --help
#+end_src

#+RESULTS:
#+begin_example
hf auth --help
Usage: hf auth [OPTIONS] COMMAND [ARGS]...

  Manage authentication (login, logout, etc.).

Options:
  -h, --help  Show this message and exit.

Main commands:
  list    List all stored access tokens. [alias: ls]
  login   Login from your browser, or using a token from
          huggingface.co/settings/tokens.
  logout  Logout from a specific token.
  switch  Switch between access tokens.
  token   Print the current access token to stdout.
  whoami  Find out which huggingface.co account you are logged in as.

Examples
  $ hf auth list
  $ hf auth login
  $ hf auth logout
  $ hf auth switch
  $ hf auth token
  $ hf auth whoami

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
<hell_end_fa1bf961-aec1-4ecd-b287-e06e5b6daa9d'[?2004l
#+end_example

* download

** Help

#+begin_src shell
  hf download --help
#+end_src

#+RESULTS:
#+begin_example
hf download --help
Usage: hf download [OPTIONS] REPO_ID [FILENAMES]...

  Download files from the Hub.

Arguments:
  REPO_ID         The ID of the repo (e.g. `username/repo-name` or
                  `spaces/username/repo-name`).  [required]
  [FILENAMES]...  Files to download (e.g. `config.json`, `data/metadata.jsonl`).

Options:
  --type, --repo-type [model|dataset|space]
                                  The type of repository (model, dataset, or space).
                                  [default: (model)]
  --revision TEXT                 Git revision id which can be a branch name, a tag,
                                  or a commit hash.
  --include TEXT                  Glob patterns to include from files to download.
                                  eg: *.json
  --exclude TEXT                  Glob patterns to exclude from files to download.
  --cache-dir TEXT                Directory where to save files.
  --local-dir TEXT                If set, the downloaded file will be placed under
                                  this directory. Check out https://huggingface.co/d
                                  ocs/huggingface_hub/guides/download#download-
                                  files-to-a-local-folder for more details.
  --force-download / --no-force-download
                                  If True, the files will be downloaded even if they
                                  are already cached.  [default: no-force-download]
  --dry-run / --no-dry-run        If True, perform a dry run without actually
                                  downloading the file.  [default: no-dry-run]
  --token TEXT                    A User Access Token generated from
                                  https://huggingface.co/settings/tokens.
  --max-workers INTEGER           Maximum number of workers to use for downloading
                                  files. Default is 8.  [default: 8]
  -h, --help                      Show this message and exit.

Formatting options:
  --format [auto|human|agent|json|quiet]
                                  Output format. Defaults to 'auto' which picks
                                  'agent' or 'human' based on the terminal.
  --json                          JSON output. Equivalent to '--format json'.
  -q, --quiet                     Quiet output (one ID per line). Equivalent to '--
                                  format quiet'.
  --no-truncate                   Do not truncate scalar values in human tables
                                  (list/dict columns stay shortened).

Examples
  $ hf download meta-llama/Llama-3.2-1B-Instruct
  $ hf download meta-llama/Llama-3.2-1B-Instruct config.json tokenizer.json
  $ hf download meta-llama/Llama-3.2-1B-Instruct --include "*.safetensors" --exclude
  "*.bin"
  $ hf download meta-llama/Llama-3.2-1B-Instruct --local-dir ./models/llama
  $ hf download HuggingFaceM4/FineVision art/ --repo-type dataset
  $ hf download hf://datasets/HuggingFaceH4/ultrachat_200k

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
<hell_end_0d8eadfe-5cb0-4129-853c-f7c6ed2849eb'[?2004l
#+end_example

* models

#+begin_src shell
  hf models --help
#+end_src

#+RESULTS:
#+begin_example
hf models --help
Usage: hf models [OPTIONS] COMMAND [ARGS]...

  Interact with models on the Hub.

Options:
  -h, --help  Show this message and exit.

Main commands:
  card  Get the model card (README) for a model on the Hub.
  info  Get info about a model on the Hub.
  list  List models on the Hub, or files in a model repo. [alias: ls]

Examples
  $ hf models card google/gemma-4-31B-it
  $ hf models info meta-llama/Llama-3.2-1B-Instruct
  $ hf models ls --sort downloads --limit 10

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
<hell_end_7630607f-2835-4734-85f7-3114aa37a29b'[?2004l
#+end_example

** card

#+begin_src shell
  hf models card --help
#+end_src

#+RESULTS:
#+begin_example
hf models card --help
Usage: hf models card [OPTIONS] MODEL_ID

  Get the model card (README) for a model on the Hub.

Arguments:
  MODEL_ID  The model ID (e.g. `username/repo-name`).  [required]

Options:
  --metadata    Output only the metadata from the card.
  --text        Output only the text body (no metadata).
  --token TEXT  A User Access Token generated from
                https://huggingface.co/settings/tokens.
  -h, --help    Show this message and exit.

Formatting options:
  --format [auto|human|agent|json|quiet]
                                  Output format. Defaults to 'auto' which picks
                                  'agent' or 'human' based on the terminal.
  --json                          JSON output. Equivalent to '--format json'.
  -q, --quiet                     Quiet output (one ID per line). Equivalent to '--
                                  format quiet'.
  --no-truncate                   Do not truncate scalar values in human tables
                                  (list/dict columns stay shortened).

Examples
  $ hf models card google/gemma-4-31B-it
  $ hf models card google/gemma-4-31B-it --metadata
  $ hf models card google/gemma-4-31B-it --metadata --format json
  $ hf models card google/gemma-4-31B-it --text

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
<hell_end_f140164d-6901-43a2-be06-d4d227344422'[?2004l
#+end_example

** list

*** help

#+begin_src shell
  hf models list --help
#+end_src

#+RESULTS:
#+begin_example
hf models list --help
Usage: hf models list [OPTIONS] [REPO_ID]

  List models on the Hub, or files in a model repo.

  When called with no argument, lists models on the Hub. When called with a model
  ID, lists files in that model repo.

Arguments:
  [REPO_ID]  Model ID (e.g. `username/repo-name`) to list files from. If omitted,
             lists models.

Options:
  --search TEXT                   Search query.
  --author TEXT                   Filter by author or organization.
  --filter TEXT                   Filter by tags (e.g. 'text-classification'). Can
                                  be used multiple times.
  --num-parameters TEXT           Filter by parameter count, e.g. 'min:6B,max:128B'.
  --sort [created_at|downloads|last_modified|likes|trending_score]
                                  Sort results.
  --limit INTEGER                 Limit the number of results.  [default: 30]
  --expand TEXT                   Comma-separated properties to return. When used,
                                  only the listed properties (and id) are returned.
                                  Example: '--expand=downloads,likes,tags'. Valid:
                                  author, baseModels, cardData, childrenModelCount,
                                  config, createdAt, disabled, downloads,
                                  downloadsAllTime, evalResults, gated, gguf,
                                  inference, inferenceProviderMapping, lastModified,
                                  library_name, likes, mask_token, model-index,
                                  pipeline_tag, private, resourceGroup, safetensors,
                                  sha, siblings, spaces, tags, transformersInfo,
                                  trendingScore, usedStorage, widgetData.
  -h, --human-readable            Show sizes in human readable format (only for
                                  listing files).
  --tree                          List files in tree format (only for listing
                                  files).
  -R, --recursive                 List files recursively (only for listing files).
  --revision TEXT                 Git revision id which can be a branch name, a tag,
                                  or a commit hash.
  --token TEXT                    A User Access Token generated from
                                  https://huggingface.co/settings/tokens.
  --help                          Show this message and exit.

Formatting options:
  --format [auto|human|agent|json|quiet]
                                  Output format. Defaults to 'auto' which picks
                                  'agent' or 'human' based on the terminal.
  --json                          JSON output. Equivalent to '--format json'.
  -q, --quiet                     Quiet output (one ID per line). Equivalent to '--
                                  format quiet'.
  --no-truncate                   Do not truncate scalar values in human tables
                                  (list/dict columns stay shortened).

Examples
  $ hf models ls --sort downloads --limit 10
  $ hf models ls --search "llama" --author meta-llama
  $ hf models ls --num-parameters min:6B,max:128B --sort likes
  $ hf models ls meta-llama/Llama-3.2-1B-Instruct
  $ hf models ls meta-llama/Llama-3.2-1B-Instruct -R
  $ hf models ls meta-llama/Llama-3.2-1B-Instruct --tree -h

Learn more
  Use `hf <command> --help` for more information about a command.
  Read the documentation at
  https://huggingface.co/docs/huggingface_hub/en/guides/cli
<hell_end_2849892f-2936-40be-8d2b-073d2bd4d9d5'[?2004l
#+end_example
